// Строки для кнопок
export const btnStrings = {
    // Меню
    restartBot: '🔄️ Перезапуск бота',
    openAssortment: '🍾 Показать ассортимент алкоголя',
    openRecipes: '🍹 Открыть меню коктейлей',
    openInfoBotCreators: 'ℹ️ Информация о создателях',

    // Подтверждение возраста
    confirm: '✅ Подтвердить',

    // Главная
    assortment: '🍾 Ассортимент алкоголя',
    recipes: '🍹 Рецепты коктейлей',
    addRecipes: '✏️ Добавить свой коктейль',
    creators: 'ℹ️ О создателях',

    // О создателях
    backToMain: '🚪 Обратно на главную',

    // Ассортимент
    assortmentReload: '🔄️ Обновить ассортимент',
    cocktail: '🍸 Коктейль',
    liquor: '🐈 Ликер',
    sake: '🍶 Сакэ',
    search: '🔎 Поиск',


    // Открытый рецепт
    nextPage: '➡️',
    backPage: '⬅️',
    nextPageToLast: 'На первую',
    backPageToFirst: 'На последнюю',
    backToChoice: '🚪 Обратно к выбору',

    // Меню выбора алкоголя
    absinthe: '🧪 Абсент',
    cognac: '🥃 Коньяк',
    gin: '🍸 Джин',
    rum: '🏴‍☠️ Ром',
    tequila: '🌵 Текила',
    vermouth: '🍷 Вермут',
    vodka: '🍶 Водка',
    whiskey: '🥃 Виски',
    wine: '🍷 Вино',
    champagne: '🍾 Шампанское',
    beer: '🍺 Пиво',
    multi: '🍹 Смешанное',

    // Форма
    openForm: '📝 Отрыть форму (Без статуса обработки)',
    openFormDesc: '📝 Форма на добавление рецепта'
}