// Основные строки
export const strings = {
    // Консоль
    userPressBtn: 'нажал на кнопку',
    userSendMsg: 'отправил сообщение',
    userSendCMD: 'отправил команду',

    // Проверка рецептов (Check Categories)
    ccLog: 'Категории',
    ccStarted: 'Инициализация категорий...',
    ccNumberCategories: "Доступно",
    ccContains: "содержит",
    ccRecipes: "рецептов",

    // Ассортимент
    assortiment: 
`Добро пожаловать в раздел выбора вида алкоголя! 🍾🍷🍹

— Здесь вы можете посмотреть ассортимент алкоголя который продается в магазинах

— Пожалуйста, нажмите на кнопку ниже, чтобы выбрать желаемый вид алкоголя. Рады помочь вам сделать правильный выбор!`,

    // Подтверждение возраста пользователя
    ageVerify: 
`Здравствуйте, уважаемый пользователь!

— Этот бот предназначен для взрослой аудитории и предоставляет информацию об алкогольных напитках. 
— Нажимая кнопку ниже, вы подтверждаете, что вам 18 лет или больше.`,

    // Главное меню
    welcome: 
`Добро пожаловать в Бота Sommelier! 🍷🍸🍹

— Я - ваш проводник в мир алкогольных страстей и утонченных вкусов. Получайте рецензии на алкогольные напитки, узнавайте их цены в сбермаркете и экспериментируйте с коктейльными рецептами.

— Просто выберите интересующий раздел ниже:`,

    // Рецепты
    recipes: 
`Приветствую вас в раздел выбора основного ингредиента! 🍾🍸🍹

— Ниже вы найдете кнопки с основными видами алкоголя, для которых у нас есть рецепты. Выберите интересующий вас ингредиент, и вы получите подробное описание этого алкоголя, а также панель с рецептами, которые можно приготовить на его основе.

— Приятного выбора и удачных экспериментов!
— Доступные рецепты по алкоголю:`,

    // О создателях
    info:
`Bot Sommelier создан двумя энтузиастами:

— 👨‍💻 Глеб (@ystenk) - Разработка и логика бота
— 👨‍🎨 Илья (@Emonzo_Kammen) - Дизайн, идея и наполнение бота

— Если вы обнаружили ошибки или у вас есть предложения, отправьте их напрямую нашим разработчикам. Мы ценим ваш вклад в улучшение нашего сервиса!`,

    // Категории
    absinthe: '🧪 Абсент — зеленый алкогольный напиток с ярким анисовым вкусом и ароматом, содержащий экстракты аптечной полыни. Обладает высоким содержанием спирта и характеризуется горьковатым вкусом. Популярен в кругах богемных художников и писателей.',
    cognac: '🥃 Коньяк — ароматный алкогольный напиток, производимый путем дистилляции виноградного спирта и омаривания в дубовых бочках. Обладает теплым янтарным цветом и насыщенным вкусом с тонами сухофруктов, ванили и пряностей. Идеально подходит для употребления в качестве дигестива после еды.',
    gin: '🍸 Джин — алкогольный напиток, получаемый путем перегонки зернового спирта с добавлением ягод можжевельника и других трав. Обладает характерным хвойным вкусом и ароматом. Используется в коктейлях и как основа для многих классических напитков.',
    rum: '🏴‍☠️ Ром — крепкий алкогольный напиток, получаемый путем ферментации и дистилляции сахарного тростника или мелассы. Обладает насыщенным вкусом с терпкими нотками, ароматом ванили и дуба. Идеально подходит для коктейлей или употребления в чистом виде.',
    tequila: '🌵 Текила — мексиканский алкогольный напиток, производимый из агавы. Имеет сильный аромат и вкус с тонами фруктов и пряностей. Используется в коктейлях или употребляется в чистом виде с лимоном и солью.',
    vermouth: '🍷 Вермут — ароматный аперитивное вино, обогащенное травами, специями и горькими травами. Обладает сладковатым вкусом с горьковатым послевкусием и ароматом трав и фруктов. Идеально подходит для приготовления коктейлей или употребления в чистом виде с льдом и долькой цитруса.',
    vodka: '🍶 Водка — прозрачный спиртной напиток, обладающий сильным вкусом и характерным ароматом. Изготавливается путем перегонки спирта и воды. Идеально подходит для коктейлей или употребления в чистом виде. Обладает высокой крепостью от 40% до 50%.',
    whiskey: '🥃 Виски — алкогольный напиток, произведенный на основе зернового сусла и выдержанный в дубовых бочках. Отличается насыщенным вкусом с тонами дыма, карамели, фруктов и пряностей. Имеет характерный аромат и золотистый цвет. Виски является одним из самых популярных спиртных напитков в мире.',
    wine: '🍷 Вино — ароматный, благородный алкогольный напиток, производимый из сока винограда. Имеет разнообразные вкусовые оттенки и телесность, обладает уникальным букетом ароматов, который развивается с возрастом. Вино является символом изысканности и наслаждения, исторически связано с культурой и традициями различных народов.',
    champagne: '🍾 Шампанское — искристое вино с высоким содержанием пузырьков углекислого газа, произведенное исключительно в регионе Шампань во Франции. Обладает свежим, фруктовым вкусом, легкой кислинкой и изысканным ароматом. Идеально подходит для торжественных мероприятий и особых случаев.',
    beer: '🍺 Пиво — освежающий алкогольный напиток с горчинкой и приятным солодовым вкусом, изготовленный из хмеля, солода, воды и дрожжей. Обладает характерным пенящимся внешним видом и янтарным цветом. Распространено и популярно во многих странах мира.',
    multi: '🍹 Смешанное — Коктейли, в которых содержится 3 и более видов алкогольных напитков.',
    
    // Дополнительные категории для магазина
    cocktail: '🍸 Коктейль — это освежающий и ароматный напиток, который состоит из различных ингредиентов, таких как спиртные напитки, фруктовые соки, ликеры, сиропы и другие добавки. Коктейли могут быть сладкими, кислыми, острыми или освежающими и подаются в стеклянных рюмках или бокалах, украшенных фруктами, ягодами или зонтиками.',
    liquor: '🐈 Ликер — сладкий алкогольный напиток с натуральными экстрактами фруктов, ягод, специй или трав. Обладает насыщенным вкусом и ароматом, часто используется в качестве десертного напитка или ингредиента для коктейлей.',
    sake: '🍶 Сакэ — традиционный японский алкогольный напиток, обычно изготавливаемый из риса. Он имеет чистый и нежный вкус, который может варьироваться от сухого и легкого до сладкого и фруктового. Сакэ пьют как в чистом виде, так и в качестве компонента для коктейлей.',

    // Ошибки
    unknownMsg: `Данный бот обрабатывает только команды! Используйте меню или перезапустите бота /start`,
    unknownCmd: `Данная команда отсутствует в моем списке команд. Используйте /start, чтобы начать!`,
    unknownActionStickerID: 'CAACAgIAAxkBAAEFzC9mWF3Q59KrB-N_svZl8L2r1KepsgAC_hwAAngpwUjXKF7yi3HyxDUE',
    errorPage: `Произошла ошибка связанная с кнопками, просьба перезапустить бота. Если не поможет - обратитесь к разработчику!`,

    // Работы с обновлением бота
    consoleLogActionFromUser: 'Попытка нажать кнопку от пользователя',
    consoleLogMessageFromUser: 'Попытка написать сообщение от пользователя',
    answerForDenyAction: "На данный момент бот недоступен для общего использования, повторите попытку позже!"
}